
###################### 2.3 循环 ###########################################


#2.3.1  while 循环

'''
while 表达式：
    语句-循环体
先判断表达式是否成立，成立就执行依次，然后继续判断，表达式一直成立一直循环
'''



#2.3.2  for 循环
'''
for 临时变脸 in 可迭代对象：
    语句
else:
    语句
    
for i in ['1','2','3','4']:
    print(i)

for i in 'aaa':
    print(i)

'''

#2.3.3  continue 循环
'''
跳出当前循环的剩余模块，继续下一个循环，一般写在if中
'''

#2.3.3  break
'''
跳出当前for 或者 while 循环，一般写在 if 中，当前循环结束
'''

#2.3.4  pass

'''
pass 是空的语句，为了保持结构的完整性
pass 不做任何事情，一般用做站位语句
例如在一个循环中，如果循环体为空，语法提示报错
这个时候空就可以使用 pass 占位
'''
















